In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Head accept only one arguments
# if we want specific range of data from DF you have to use - df.iloc[1],df.iloc[1:5]
# what is the meaning of iloc - index based location

In [7]:
data = {'animal': ['dog','cat'],
       'age':[1,2],
       'visits':[np.nan,10],
        'priority':['yes','no']
       }

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  animal  age  visits priority
0    dog    1     NaN      yes
1    cat    2    10.0       no

In [11]:
df.describe()

            age  visits
count  2.000000     1.0
mean   1.500000    10.0
std    0.707107     NaN
min    1.000000    10.0
25%    1.250000    10.0
50%    1.500000    10.0
75%    1.750000    10.0
max    2.000000    10.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    2 non-null      object
 1   age       2 non-null      int64
 2   visits    1 non-null      float64
 3   priority  2 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 192.0+ bytes

In [13]:
# IF I want to insert one more column
# The count should be matched. if the counts are not matched it through the error

In [14]:
df['location']=['trichy','chennai']

In [15]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [16]:
df[['animal','age']] #It will pick specified columns  only

  animal  age
0    dog    1
1    cat    2

In [17]:
for col in df.columns:
    series = df[col]
    print(series)

0    dog
1    cat
Name: animal, dtype: object
0    1
1    2
Name: age, dtype: int64
0     NaN
1    10.0
Name: visits, dtype: float64
0    yes
1     no
Name: priority, dtype: object
0     trichy
1    chennai
Name: location, dtype: object

In [22]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [24]:
# Added specified column
df.loc[12] = ['frog',1,3,'yes','ch']

In [36]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [37]:
ind = ['a','b']
df1 = pd.DataFrame(data,index=ind)

In [38]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [39]:
df1.drop('b')

  animal  age  visits priority
a    dog    1     NaN      yes

In [40]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [41]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [44]:
df1.loc[:,['animal','age']] #df[['animal','age']] this are the two different approches

  animal  age
a    dog    1
b    cat    2

In [47]:
df.loc[df.index[[1,2]],['animal','age']] #we use the filteration method here

   animal  age
1     cat    2
12   frog    1

In [48]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [55]:
df[df['visits']>3]
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [56]:
df[(df['visits']>3) & (df["animal"]=="cat")]

  animal  age  visits priority location
1    cat    2    10.0       no  chennai

In [57]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [58]:
df.groupby('animal')['age'].mean()

animal
cat     2.0
dog     1.0
frog    1.0
Name: age, dtype: float64

In [59]:
df['animal'].value_counts() #counting the animals values

dog     1
cat     1
frog    1
Name: animal, dtype: int64

In [61]:
df.sort_values(by='age', ascending=False) #sorting the values. If we want two columns use list and

   animal  age  visits priority location
1     cat    2    10.0       no  chennai
0     dog    1     NaN      yes   trichy
12   frog    1     3.0      yes       ch

In [63]:
df.sort_values(by=['visits','age'], ascending=[False, True]) #Multiple column and Multiple conditions in sort

   animal  age  visits priority location
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch
0     dog    1     NaN      yes   trichy

In [64]:
df['animal'] = df['animal'].replace('cat','lion') #How to replace it

In [65]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1    lion    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [68]:
df['animal'] = df['animal'].map({'lion':'snake','frog':'python'})

In [69]:
df

   animal  age  visits priority location
0     NaN    1     NaN      yes   trichy
1     NaN    2    10.0       no  chennai
12    NaN    1     3.0      yes       ch

In [70]:
# map - if the value was there it replace, else it return Nan

In [71]:
# for google labs file upload
# from google.colab import files
# files.upload()

In [72]:
# Read a csv file

In [88]:
df3  = pd.read_csv(r"C:\Users\sitha\Projects\refactoring\Datascience\data\Binary predictors.csv")
df3

     Marks Admitted  Gender
0     1363       No    Male
1     1792      Yes  Female
2     1954      Yes  Female
3     1653       No    Male
4     1593       No    Male
..     ...      ...     ...
163   1722      Yes  Female
164   1750      Yes    Male
165   1555       No    Male
166   1524       No    Male
167   1461       No    Male

[168 rows x 3 columns]

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 12
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    0 non-null      object
 1   age       3 non-null      int64
 2   visits    2 non-null      float64
 3   priority  3 non-null      object
 4   location  3 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.0+ bytes

In [90]:
# I want to change all yes to no and all no to yes
df3['Admitted'] =  df3['Admitted'].map({'Yes':'1','No':'0'})

In [91]:
df3

     Marks Admitted  Gender
0     1363        0    Male
1     1792        1  Female
2     1954        1  Female
3     1653        0    Male
4     1593        0    Male
..     ...      ...     ...
163   1722        1  Female
164   1750        1    Male
165   1555        0    Male
166   1524        0    Male
167   1461        0    Male

[168 rows x 3 columns]

In [93]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [99]:
import pandas as pd
df4 = pd.read_excel(r"C:\Users\sitha\Projects\refactoring\Datascience\data\Sample_Employee_data_xlsx.xlsx")
df4

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [101]:
df5 = pd.read_json(r"C:\Users\sitha\Projects\refactoring\Datascience\data\anscombe.json")

In [102]:
df5

   Series   X      Y
0       I  10   8.04
1       I   8   6.95
2       I  13   7.58
3       I   9   8.81
4       I  11   8.33
5       I  14   9.96
6       I   6   7.24
7       I   4   4.26
8       I  12  10.84
9       I   7   4.81
10      I   5   5.68
11     II  10   9.14
12     II   8   8.14
13     II  13   8.74
14     II   9   8.77
15     II  11   9.26
16     II  14   8.10
17     II   6   6.13
18     II   4   3.10
19     II  12   9.13
20     II   7   7.26
21     II   5   4.74
22    III  10   7.46
23    III   8   6.77
24    III  13  12.74
25    III   9   7.11
26    III  11   7.81
27    III  14   8.84
28    III   6   6.08
29    III   4   5.39
30    III  12   8.15
31    III   7   6.42
32    III   5   5.73
33     IV   8   6.58
34     IV   8   5.76
35     IV   8   7.71
36     IV   8   8.84
37     IV   8   8.47
38     IV   8   7.04
39     IV   8   5.25
40     IV  19  12.50
41     IV   8   5.56
42     IV   8   7.91
43     IV   8   6.89

In [104]:
df6 = df5.where(df5.Series=='II') #Specific Value based filtering

In [105]:
df6

   Series     X     Y
0     NaN   NaN   NaN
1     NaN   NaN   NaN
2     NaN   NaN   NaN
3     NaN   NaN   NaN
4     NaN   NaN   NaN
5     NaN   NaN   NaN
6     NaN   NaN   NaN
7     NaN   NaN   NaN
8     NaN   NaN   NaN
9     NaN   NaN   NaN
10    NaN   NaN   NaN
11     II  10.0  9.14
12     II   8.0  8.14
13     II  13.0  8.74
14     II   9.0  8.77
15     II  11.0  9.26
16     II  14.0  8.10
17     II   6.0  6.13
18     II   4.0  3.10
19     II  12.0  9.13
20     II   7.0  7.26
21     II   5.0  4.74
22    NaN   NaN   NaN
23    NaN   NaN   NaN
24    NaN   NaN   NaN
25    NaN   NaN   NaN
26    NaN   NaN   NaN
27    NaN   NaN   NaN
28    NaN   NaN   NaN
29    NaN   NaN   NaN
30    NaN   NaN   NaN
31    NaN   NaN   NaN
32    NaN   NaN   NaN
33    NaN   NaN   NaN
34    NaN   NaN   NaN
35    NaN   NaN   NaN
36    NaN   NaN   NaN
37    NaN   NaN   NaN
38    NaN   NaN   NaN
39    NaN   NaN   NaN
40    NaN   NaN   NaN
41    NaN   NaN   NaN
42    NaN   NaN   NaN
43    NaN   NaN   NaN

In [113]:
df5.where((df5.Series =="IV") | (df5.Series =="II"))

   Series     X      Y
0     NaN   NaN    NaN
1     NaN   NaN    NaN
2     NaN   NaN    NaN
3     NaN   NaN    NaN
4     NaN   NaN    NaN
5     NaN   NaN    NaN
6     NaN   NaN    NaN
7     NaN   NaN    NaN
8     NaN   NaN    NaN
9     NaN   NaN    NaN
10    NaN   NaN    NaN
11     II  10.0   9.14
12     II   8.0   8.14
13     II  13.0   8.74
14     II   9.0   8.77
15     II  11.0   9.26
16     II  14.0   8.10
17     II   6.0   6.13
18     II   4.0   3.10
19     II  12.0   9.13
20     II   7.0   7.26
21     II   5.0   4.74
22    NaN   NaN    NaN
23    NaN   NaN    NaN
24    NaN   NaN    NaN
25    NaN   NaN    NaN
26    NaN   NaN    NaN
27    NaN   NaN    NaN
28    NaN   NaN    NaN
29    NaN   NaN    NaN
30    NaN   NaN    NaN
31    NaN   NaN    NaN
32    NaN   NaN    NaN
33     IV   8.0   6.58
34     IV   8.0   5.76
35     IV   8.0   7.71
36     IV   8.0   8.84
37     IV   8.0   8.47
38     IV   8.0   7.04
39     IV   8.0   5.25
40     IV  19.0  12.50
41     IV   8.0   5.56
42     IV   8.0   7.91
43     IV   8.0   6.89

In [114]:
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)

technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [115]:
df1

    Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Python  22000   35days
r4   pandas  30000   50days

In [116]:
df2

   Courses  Discount
r1   Spark      2000
r6    Java      2300
r3  Python      1200
r5      Go      2000

In [117]:
df3 = pd.merge(df1,df2) #Merging based on the pandas.merge

In [118]:
df3 # See the output - like a inner join

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [119]:
df4 = df1.merge(df2) #Merging based on Dataframe

In [120]:
df4

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [125]:
df5 = pd.merge(df1, df2, left_on='Courses', right_on='Courses')

In [126]:
df5

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [130]:
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)

technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [132]:
df5 = pd.merge(df1, df2, left_on='Courses', right_on='Courses')

In [133]:
df5

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [136]:
df6 = pd.merge(df1,df2, on='Courses', how = 'left') #inner, By default its working inner Join

In [137]:
df6

   Courses    Fee Duration  Discount
0    Spark  20000   30days    2000.0
1  PySpark  25000   40days       NaN
2   Python  22000   35days    1200.0
3   pandas  30000   50days       NaN

In [138]:
df6 = pd.merge(df1,df2, on='Courses', how = 'outer') #outer

In [139]:
df6

   Courses      Fee Duration  Discount
0    Spark  20000.0   30days    2000.0
1  PySpark  25000.0   40days       NaN
2   Python  22000.0   35days    1200.0
3   pandas  30000.0   50days       NaN
4     Java      NaN      NaN    2300.0
5       Go      NaN      NaN    2000.0